#include <stdio.h>
gen(int m);                                //求乘积根的函数 
void main()
{
	int n,i,num[10000]={0},count[9]={0};   //两个变量  各个数的乘积根的数组 乘积根为1到9的数的个数组成的数组
	for(n=1;n<10001;n++)                   //统计数据是从1开始 到10000为止
	{
		num[n]=gen(n);
	    count[num[n]-1]++;
	}
	printf("\n_______________________________________________________________________________\n");
	printf("乘积根的值");
	for(i=0;i<9;i++)
		printf("%6d",i+1);
	printf("\n_______________________________________________________________________________\n");
	printf("   个数    ");
	for(i=0;i<9;i++)
		printf("%6d",count[i]);
	printf("\n_______________________________________________________________________________\n");
	printf("\n\n");
}


gen(int m)                             //求乘积根的函数 
{
	int n1,n2,n3,n4,n;
	n=m;
	{
		for(;n>=10;)                   //分离四个数位上的数值
		{
			n1=m/1000;
			n2=(m/100)%10;
			n3=(m%100)/10;
			n4=m%10;
			if(n1==0)
				n1=1;
			if(n2==0)
				n2=1;
			if(n3==0)
				n3=1;
			if(n4==0)
				n4=1;
			n=n1*n2*n3*n4;
			if(n<10) 
				return(n);
			else                         //递归
				n=gen(n);
		}
		return(n);}
}